---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendData.HookAngle0
source: html/20652e88-8d2e-b612-8d80-3752ec8f9362.htm
---
# Autodesk.Revit.DB.Structure.RebarBendData.HookAngle0 Property

The angle of the hook at the start.

## Syntax (C#)
```csharp
public int HookAngle0 { get; set; }
```